{
  "backend/main.mo": "Defines language-learning data types and seeds initial languages and conversation scenarios for the backend actor.",
  "feature_evidence.json": "Contains feature evidence entries mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lists short descriptions of many frontend files and their roles in the app.",
  "frontend/index.css": "Sets up Tailwind base styles and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme and toast providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting first‑time users to set a display name and saves the profile.",
  "frontend/src/components/languages/LanguageIcon.tsx": "Displays a language icon image with fallback to a globe icon on load failure.",
  "frontend/src/components/learning/LearningNodeModal.tsx": "Modal component that displays and manages interaction with a learning node, handling steps, completion, XP rewards, and progress updates.",
  "frontend/src/components/learning/LearningPath.tsx": "Renders the vertical learning path layout and unit headers, delegating individual node rendering and click handling.",
  "frontend/src/components/learning/learningPathModel.ts": "Defines the PathNode model and builds the learning path by interleaving culture and conversation nodes, grouping into units, and marking next-up/locked states.",
  "frontend/src/components/learning/LearningPathNode.tsx": "Displays a single learning path node with status indicators, XP info, and an interactive button styled by type and progress state.",
  "frontend/src/components/minigames/ListeningComprehensionGame.tsx": "Implements a timed listening comprehension minigame that selects questions by difficulty, tracks score and progress, and saves results on completion.",
  "frontend/src/components/minigames/RepeatableChallenge.tsx": "Implements a timed multiple-choice challenge that scales with user level, tracks score, and persists results when finished.",
  "frontend/src/components/minigames/SentenceBuilderGame.tsx": "Implements a timed sentence-building minigame where users assemble shuffled words, track score, and complete via backend mutation.",
  "frontend/src/components/minigames/VocabularyQuizGame.tsx": "Provides a timed multiple‑choice vocabulary quiz that scores answers, cycles through questions, and submits results.",
  "frontend/src/components/minigames/WordMatchGame.tsx": "Creates a timed word‑matching game pairing words with translations, tracking matches, score, and completion.",
  "frontend/src/components/nuru/AppLayout.tsx": "Defines the main app layout with header, nav, footer, and routed content, including user login and XP display.",
  "frontend/src/components/nuru/SectionCard.tsx": "Renders a stylized section card with icon, counts, and navigation button for different learning sections.",
  "frontend/src/components/progression/LevelUpToast.tsx": "Shows a toast notification when the user levels up.",
  "frontend/src/components/progression/XpProgressBar.tsx": "Displays the user’s level and XP progress using backend progress queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements React context and provider for Internet Identity authentication, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as languages, scenarios, culture entries, user progress, and profile updates.",
  "frontend/src/index.css": "Defines global Tailwind styles and theme variables for light and dark modes, including custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ConversationPage.tsx": "Renders conversation practice scenarios with step navigation, completion handling, XP rewards, and login checks.",
  "frontend/src/pages/CulturePage.tsx": "Displays cultural learning entries with filtering, completion logic, XP rewards, and simple ID hashing.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the main user dashboard with progress stats, language selection, and navigation to learning sections.",
  "frontend/src/pages/LanguageSelectPage.tsx": "Page that lists available languages, shows loading skeletons, and lets authenticated users select and save their preferred language.",
  "frontend/src/pages/LearningPage.tsx": "Builds and displays a personalized learning path using culture entries and scenarios, with a modal for viewing individual nodes.",
  "frontend/src/pages/ListeningPage.tsx": "Provides listening practice with predefined word lists per language and uses browser TTS to play audio for each item.",
  "frontend/src/pages/MinigamesPage.tsx": "Fetches minigame configs, shows selectable minigame cards, and renders the chosen interactive game based on user level.",
  "frontend/src/utils/difficulty.ts": "Calculates difficulty settings and labels based on user level and provides scaling presets for different game modes.",
  "frontend/src/utils/learningContent.ts": "Helpers for extracting display text, translations, previews, and dialogue fields from culture content with safe fallbacks.",
  "frontend/src/utils/tts.ts": "Utility for selecting language-appropriate speech synthesis voices and speaking text via the browser TTS API.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/src/utils/xpModel.ts": "Implements XP progression calculations, including level thresholds, progress percentage, XP-to-level conversion, and formatting.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins.",
  "project_state.json": "Defines the project state, existing features, pending requests, and image requirements for the Nuru project."
}