{
  "backend/main.mo": "Main Motoko actor defining types (Language, ConversationScenario, CultureEntry, MinigameConfig, UserProgress, UserProfile) and seeding data for 6 African languages with conversation scenarios, culture entries, and minigame configurations.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for increasing minigame time limits and question counts, listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx, hooks, components, pages, and utilities with details about minigame scaling, difficulty settings, and extended time limits.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the Nuru application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, Languages, Listening, Conversation, Culture, Minigames, and Learning pages, wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, prompting for display name after Internet Identity authentication and saving profile with default values.",
  "frontend/src/components/languages/LanguageIcon.tsx": "Language icon component displaying generated language-specific icons with fallback to Globe icon on image load error.",
  "frontend/src/components/learning/LearningNodeModal.tsx": "Modal component that displays detailed content for culture entries or conversation scenarios, handles step-by-step progression through dialogues, and manages completion with XP rewards and level-up notifications.",
  "frontend/src/components/learning/LearningPath.tsx": "Container component that renders a vertical learning path with unit headers and nodes, handling click events only for unlocked nodes.",
  "frontend/src/components/learning/learningPathLimit.ts": "Configuration file that exports a constant defining the maximum number of learning path nodes to display (20).",
  "frontend/src/components/learning/learningPathModel.ts": "Defines the PathNode data model and buildLearningPath function that interleaves culture and conversation content, groups them into units, and determines completion/lock states based on user progress.",
  "frontend/src/components/learning/LearningPathNode.tsx": "Individual node component displaying culture or conversation items with completion status, lock state, XP rewards, and visual indicators for next-up items.",
  "frontend/src/components/minigames/ListeningComprehensionGame.tsx": "Listening comprehension minigame with timed multiple-choice questions in Yoruba and Swahili, featuring difficulty scaling based on user level and XP rewards upon completion.",
  "frontend/src/components/minigames/RepeatableChallenge.tsx": "Timed quiz minigame with multilingual translation questions (Spanish, French, Arabic, Swahili, Yoruba) that scales difficulty based on user level and awards XP on completion.",
  "frontend/src/components/minigames/SentenceBuilderGame.tsx": "A minigame component where users arrange shuffled words to form correct sentences in Arabic or Swahili, with timer, scoring, difficulty scaling, and backend completion tracking.",
  "frontend/src/components/minigames/VocabularyQuizGame.tsx": "A multiple-choice vocabulary quiz minigame for Arabic or Swahili with timed questions, scoring, difficulty progression, and completion tracking via backend.",
  "frontend/src/components/minigames/WordMatchGame.tsx": "A word-matching minigame where users pair foreign language words with English translations, featuring timer, scoring, difficulty scaling, and backend integration.",
  "frontend/src/components/nuru/AppLayout.tsx": "Main application layout component with header, navigation bar, footer, and routing; includes XP progress bar, login button, and profile setup modal.",
  "frontend/src/components/nuru/SectionCard.tsx": "Reusable card component for displaying learning sections with icon, title, description, progress badge, and navigation button with variant-based color theming.",
  "frontend/src/components/progression/LevelUpToast.tsx": "Displays a toast notification when the user levels up, showing the new level with trophy and sparkle icons.",
  "frontend/src/components/progression/XpProgressBar.tsx": "Displays user's current level, XP progress bar, and XP needed for next level in the header, fetching data from backend queries.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, handling both authenticated and anonymous states with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching languages, conversation scenarios, culture entries, minigame configs, user progress, and user profiles, plus mutations for saving profiles, setting languages, and completing dialogues.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the Web Speech Recognition API to provide speech-to-text functionality with language-specific configuration and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm amber/orange color theme for light and dark modes, plus a wave animation utility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ConversationPage.tsx": "Interactive conversation practice page where users select scenarios, respond to dialogue prompts via text or speech input, receive feedback on answers, and earn XP upon completion.",
  "frontend/src/pages/CulturePage.tsx": "Displays cultural and historical learning content entries with filtering options, allowing authenticated users to mark entries as completed and earn XP rewards.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user progress, language selection, and navigation cards to different learning sections (dialogues, culture, listening, minigames). Includes hero section with XP/level display and language switcher.",
  "frontend/src/pages/LanguageSelectPage.tsx": "Dedicated language selection page showing available languages as clickable cards with icons, descriptions, and selection status. Allows authenticated users to set their preferred learning language.",
  "frontend/src/pages/LearningPage.tsx": "Learning path page that displays a sequential progression of culture entries and conversation scenarios as unlockable nodes. Includes node limit handling and modal for viewing individual lesson details.",
  "frontend/src/pages/ListeningPage.tsx": "Listening practice page with hardcoded lessons for six languages (Arabic, Swahili, Hausa, Amharic, Yoruba, Zulu). Features text-to-speech playback, multiple-choice quizzes, and progress tracking with XP rewards.",
  "frontend/src/pages/MinigamesPage.tsx": "Minigames hub page displaying available game modes (Word Match, Sentence Builder, Vocabulary Quiz, Listening Comprehension, Mixed Challenge) with difficulty scaling based on user level. Routes to specific game components when selected.",
  "frontend/src/utils/difficulty.ts": "Difficulty scaling utility that adjusts game parameters (time limits, item counts, distractor counts) based on user level across beginner/intermediate/advanced tiers. Provides game-mode-specific configurations.",
  "frontend/src/utils/learningContent.ts": "Helper utilities for safely extracting and displaying culture content and dialogue steps with target-language-first approach and fallback handling for optional fields.",
  "frontend/src/utils/tts.ts": "Provides text-to-speech and speech recognition utilities with language code mappings for 6 African languages (Arabic, Swahili, Hausa, Amharic, Yoruba, Zulu), including functions to get voices, speak text, and load browser speech synthesis voices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/xpModel.ts": "Implements XP (experience points) progression model with exponential level growth, providing functions to calculate XP thresholds, progress percentages, and level from XP values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom font families (Inter, Poppins).",
  "project_state.json": "Project metadata tracking existing features for extending minigame time limits and question counts, with pending feature requests to add more learning units and backend content for 6 African languages."
}