{
  "backend/main.mo": "Main Motoko actor defining all data types (Language, ConversationScenario, CultureEntry, MinigameConfig, UserProgress, etc.) and seeding initial content for 6 African languages with conversation scenarios, culture entries, and minigame configurations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, pages, hooks, and utilities for the language learning application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including primary, secondary, accent, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Nuru application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, Languages, Listening, Conversation, Culture, Minigames, and Learning pages, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity authentication button component handling login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup prompting for display name after Internet Identity authentication, with form validation and submission handling.",
  "frontend/src/components/languages/LanguageIcon.tsx": "Component rendering language-specific icons from generated assets with fallback to Globe icon on image load error.",
  "frontend/src/components/learning/LearningNodeModal.tsx": "Modal dialog for displaying and completing learning path nodes (culture entries or conversation scenarios) with step-by-step progression, XP rewards, and level-up notifications.",
  "frontend/src/components/learning/LearningPath.tsx": "Component rendering a vertical learning path with nodes positioned alternately left/right along a gradient line, showing unit headers and handling node click interactions.",
  "frontend/src/components/learning/learningPathLimit.ts": "Configuration file that exports a constant defining the maximum number of learning path nodes to display (20).",
  "frontend/src/components/learning/learningPathModel.ts": "Defines the PathNode interface and buildLearningPath function that interleaves culture and conversation content into a structured learning path with completion tracking, locking logic, and unit grouping (5 nodes per unit).",
  "frontend/src/components/learning/LearningPathNode.tsx": "React component that renders an individual learning path node with icon, title, XP badge, completion status, and lock state. Supports left/right positioning and displays visual indicators for completed, next-up, and locked states.",
  "frontend/src/components/minigames/ListeningComprehensionGame.tsx": "Minigame component for listening comprehension with timed multiple-choice questions in Yoruba and Swahili. Includes difficulty scaling, score tracking, and completion hooks for saving progress.",
  "frontend/src/components/minigames/RepeatableChallenge.tsx": "Timed quiz minigame with multilingual questions (Spanish, French, Arabic, Swahili, Yoruba) that adapts difficulty based on user level. Tracks score and allows repeatable play with completion rewards.",
  "frontend/src/components/minigames/SentenceBuilderGame.tsx": "Interactive minigame where users construct sentences by selecting words in correct order for Arabic and Swahili. Features difficulty scaling, timer, score tracking, and progress saving.",
  "frontend/src/components/minigames/VocabularyQuizGame.tsx": "Multiple-choice vocabulary quiz minigame for Arabic and Swahili with timed questions, difficulty scaling based on user level, and score tracking with completion rewards.",
  "frontend/src/components/minigames/WordMatchGame.tsx": "A word-matching minigame component that displays words in a target language (Arabic or Swahili) and their English translations for users to match within a time limit, with difficulty scaling based on user level.",
  "frontend/src/components/nuru/AppLayout.tsx": "Main application layout component providing header with logo and XP bar, navigation menu for different learning sections (Home, Learning, Listening, Conversation, Culture, Games), and footer with social links.",
  "frontend/src/components/nuru/SectionCard.tsx": "Reusable card component for displaying learning section information with icon, title, description, progress badge, and navigation button, supporting different color variants for each section type.",
  "frontend/src/components/progression/LevelUpToast.tsx": "Toast notification component that displays a celebratory message with trophy icon when a user levels up.",
  "frontend/src/components/progression/XpProgressBar.tsx": "Progress bar component displaying user's current level, XP, and progress toward next level using data from user progress queries.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling both anonymous and authenticated states, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including languages, conversation scenarios, culture content, minigames, user progress, and user profiles.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the Web Speech Recognition API to provide voice input functionality with support for different languages, returning listening state, transcript, and control methods.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm amber/orange color theme for both light and dark modes, plus a wave animation utility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/ConversationPage.tsx": "Interactive conversation practice page where users engage in dialogue scenarios with speech recognition support, answer validation, and XP rewards upon completion.",
  "frontend/src/pages/CulturePage.tsx": "Culture learning page displaying cultural entries (history, traditions) for the selected language with filtering, completion tracking, and XP rewards.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing user progress, language selection, and navigation cards to different learning sections (listening, conversation, culture, minigames, vocabulary).",
  "frontend/src/pages/LanguageSelectPage.tsx": "Language selection page displaying available languages as cards, allowing authenticated users to choose their learning language with visual feedback for the current selection.",
  "frontend/src/pages/LearningPage.tsx": "Displays a personalized learning path with culture entries and conversation scenarios, showing nodes that can be clicked to open modals for unlocked content. Applies a node limit and shows an alert when the path is truncated.",
  "frontend/src/pages/ListeningPage.tsx": "Provides listening practice lessons for multiple languages (Arabic, Swahili, Hausa, Amharic, Yoruba, Zulu) with text-to-speech playback, organized by categories like greetings, directions, and food.",
  "frontend/src/pages/MinigamesPage.tsx": "Displays available minigames (word match, sentence builder, vocabulary quiz, listening comprehension, repeatable challenge) and launches the selected game component with difficulty scaling based on user level.",
  "frontend/src/utils/difficulty.ts": "Calculates difficulty parameters (time limit, item count, distractor count, prompt length) based on user level and game mode, scaling from beginner to advanced.",
  "frontend/src/utils/learningContent.ts": "Provides helper functions to safely extract and display culture content text, translations, and previews with fallbacks for missing optional fields.",
  "frontend/src/utils/tts.ts": "Handles text-to-speech functionality by mapping language IDs to BCP-47 codes, selecting appropriate voices, and providing speak/load functions for browser TTS API.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/src/utils/xpModel.ts": "Implements XP and leveling calculations with exponential growth, including functions to determine level from XP, calculate progress percentage, and format XP values for display.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including fonts (Inter, Poppins), border radius variables, custom shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for Nuru language learning app tracking four pending feature requests to add units, conversation scenarios, and culture entries about malls, shops, and places across 6 African languages (Arabic, Swahili, Hausa, Amharic, Yoruba, Zulu)."
}