{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add shopping and location learning units (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure new shopping-related conversation scenarios and culture entries appear as unlockable nodes in the learning path",
      "acceptanceCriteria": [
        "New shopping-related units appear in the LearningPage as nodes in the learning path",
        "Units are properly grouped and labeled (e.g., 'Unit 3: Shopping & Places', 'Unit 4: Markets & Stores')",
        "Lock/unlock states work correctly based on completion of previous nodes",
        "XP rewards are properly awarded upon completion of shopping-related lessons",
        "The learningPathLimit of 20 nodes is respected and new content is included within this display constraint"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/learning/learningPathModel.ts",
          "operation": "modify",
          "description": "Review the buildLearningPath function to verify it correctly interleaves new shopping-related conversation scenarios and culture entries into the learning path. The existing logic already handles grouping content into units (every 4 nodes) and determining lock/unlock states based on user progress. No changes are expected unless the current grouping logic needs adjustment to better accommodate shopping-themed content. Ensure the function continues to respect the learningPathLimit of 20 nodes defined in learningPathLimit.ts."
        },
        {
          "path": "frontend/src/pages/LearningPage.tsx",
          "operation": "modify",
          "description": "Verify that the LearningPage correctly renders new shopping-related nodes fetched from the backend. The page already uses useConversationScenarios and useCultureEntries hooks to fetch data and buildLearningPath to construct the node structure. Ensure the LearningNodeModal properly displays shopping-related dialogues and culture content. No changes are expected unless modal rendering needs adjustment for shopping scenarios. The page already handles completion tracking and XP rewards via completeDialogue and completeCultureEntry mutations."
        }
      ]
    }
  ]
}